{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "decoder_start_token_id": null,
  "dtype": "float32",
  "eos_token_id": null,
  "finetuning_task": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-DISEASE",
    "2": "I-DISEASE",
    "3": "B-CHEMICAL",
    "4": "I-CHEMICAL",
    "5": "B-DRUG",
    "6": "I-DRUG",
    "7": "B-SYMPTOM",
    "8": "I-SYMPTOM",
    "9": "B-PROCEDURE",
    "10": "I-PROCEDURE",
    "11": "B-ANATOMY",
    "12": "I-ANATOMY"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-ANATOMY": 11,
    "B-CHEMICAL": 3,
    "B-DISEASE": 1,
    "B-DRUG": 5,
    "B-PROCEDURE": 9,
    "B-SYMPTOM": 7,
    "I-ANATOMY": 12,
    "I-CHEMICAL": 4,
    "I-DISEASE": 2,
    "I-DRUG": 6,
    "I-PROCEDURE": 10,
    "I-SYMPTOM": 8,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "prefix": null,
  "pruned_heads": {},
  "task_specific_params": null,
  "tie_word_embeddings": true,
  "torchscript": false,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_bfloat16": false,
  "use_cache": true,
  "vocab_size": 28996,
  "xla_device": null
}
