{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "eos_token_ids": 0,
  "finetuning_task": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PERSON",
    "2": "I-PERSON",
    "3": "B-ORG",
    "4": "I-ORG",
    "5": "B-COURT",
    "6": "I-COURT",
    "7": "B-DATE",
    "8": "I-DATE",
    "9": "B-LAW",
    "10": "I-LAW",
    "11": "B-CASE",
    "12": "I-CASE",
    "13": "B-LOCATION",
    "14": "I-LOCATION"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-CASE": 11,
    "B-COURT": 5,
    "B-DATE": 7,
    "B-LAW": 9,
    "B-LOCATION": 13,
    "B-ORG": 3,
    "B-PERSON": 1,
    "I-CASE": 12,
    "I-COURT": 6,
    "I-DATE": 8,
    "I-LAW": 10,
    "I-LOCATION": 14,
    "I-ORG": 4,
    "I-PERSON": 2,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pruned_heads": {},
  "tie_word_embeddings": true,
  "torchscript": false,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_bfloat16": false,
  "use_cache": true,
  "vocab_size": 30522
}
